zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/coord/main.c
            case macDeviceTableEntries:
                {
	                    static uint8_t Temp = 0;
	                    uint8_t mac_dev_table[17];
	                    for (uint8_t i = Temp; i < no_of_assoc_devices; i++) // Temp is used to not update the already device table again
	                    {
		                    mac_dev_table[0] = (uint8_t)tal_pib.PANId;
		                    mac_dev_table[1] = (uint8_t)(tal_pib.PANId >> 8);
		                    mac_dev_table[2] = (uint8_t)device_list[i].short_addr;
		                    mac_dev_table[3] = (uint8_t)(device_list[i].short_addr >> 8);
		                    mac_dev_table[4] = (uint8_t)device_list[i].ieee_addr;
		                    mac_dev_table[5] = (uint8_t)(device_list[i].ieee_addr >> 8);
		                    mac_dev_table[6] = (uint8_t)(device_list[i].ieee_addr >> 16);
		                    mac_dev_table[7] = (uint8_t)(device_list[i].ieee_addr >> 24);
		                    mac_dev_table[8] = (uint8_t)(device_list[i].ieee_addr >> 32);
		                    mac_dev_table[9] = (uint8_t)(device_list[i].ieee_addr >> 40);
		                    mac_dev_table[10] = (uint8_t)(device_list[i].ieee_addr >> 48);
		                    mac_dev_table[11] = (uint8_t)(device_list[i].ieee_addr >> 56);
		                    mac_dev_table[12] = 0;  // Frame counter
		                    mac_dev_table[13] = 0;
		                    mac_dev_table[14] = 0;
		                    mac_dev_table[15] = 0;
		                    mac_dev_table[16] = 0;  // Exempt

		                    wpan_mlme_set_req(macDeviceTable,
		                    i,    // Index
		                    &mac_dev_table);
	                    }
	                    Temp++;
                }
                break;

            case macDeviceTable:
                {
                    /* Use DSN start value as in ZIP test spec. */
                    uint8_t new_dsn = 0x0;

                    wpan_mlme_set_req(macDSN,
                                      NO_PIB_INDEX,
                                      &new_dsn);
                }
                break;

            case macDSN:
                {
                    /* Use DSN start value as in ZIP test spec. */
                    uint32_t frame_counter = 1;

                    wpan_mlme_set_req(macFrameCounter,
                                      NO_PIB_INDEX,
                                      &frame_counter);
                }
                break;

            case macFrameCounter:
                break;

            default:
                // undesired PIB attribute; restart
                wpan_mlme_reset_req(true);
                break;
		}
    }

    /* Keep compiler happy. */
    PIBAttributeIndex = PIBAttributeIndex;
}
#else
void usr_mlme_set_conf(uint8_t status,
		uint8_t PIBAttribute)
{
	if ((status == MAC_SUCCESS) && (PIBAttribute == macShortAddress)) {
		/*
		 * Allow other devices to associate to this coordinator.
		 * Use: bool wpan_mlme_set_req(uint8_t PIBAttribute,
		 *                             void *PIBAttributeValue);
		 *
		 * This request leads to a set confirm message ->
		 *usr_mlme_set_conf
		 */
		uint8_t association_permit = true;

		wpan_mlme_set_req(macAssociationPermit,0, &association_permit);
	} else if ((status == MAC_SUCCESS) &&
			(PIBAttribute == macAssociationPermit)) {
		/*
		 * Set RX on when idle to enable the receiver as default.
		 * Use: bool wpan_mlme_set_req(uint8_t PIBAttribute,
		 *                             void *PIBAttributeValue);
		 *
		 * This request leads to a set confirm message ->
		 *usr_mlme_set_conf
		 */
		bool rx_on_when_idle = true;

		wpan_mlme_set_req(macRxOnWhenIdle, 0,&rx_on_when_idle);
	} else if ((status == MAC_SUCCESS) &&
			(PIBAttribute == macRxOnWhenIdle)) {
		/* Set the beacon payload length. */
		uint8_t beacon_payload_len = BEACON_PAYLOAD_LEN;
		wpan_mlme_set_req(macBeaconPayloadLength,0, &beacon_payload_len);
	} else if ((status == MAC_SUCCESS) &&
			(PIBAttribute == macBeaconPayloadLength)) {
		/*
		 * Once the length of the beacon payload has been defined,
		 * set the actual beacon payload.
		 */
		wpan_mlme_set_req(macBeaconPayload, 0,&beacon_payload);
	} else if ((status == MAC_SUCCESS) &&
			(PIBAttribute == macBeaconPayload)) {
		if (COORD_STARTING == coord_state) {
			/*
			 * Initiate an active scan over all channels to
			 *determine
			 * which channel to use.
			 * Use: bool wpan_mlme_scan_req(uint8_t ScanType,
			 *                              uint32_t ScanChannels,
			 *                              uint8_t ScanDuration,
			 *                              uint8_t ChannelPage);
			 *
			 * This request leads to a scan confirm message ->
			 *usr_mlme_scan_conf
			 * Scan for about 50 ms on each channel -> ScanDuration
			 *= 1
			 * Scan for about 1/2 second on each channel ->
			 *ScanDuration = 5
			 * Scan for about 1 second on each channel ->
			 *ScanDuration = 6
			 */
			wpan_mlme_scan_req(MLME_SCAN_TYPE_ACTIVE,
					SCAN_CHANNEL,
					SCAN_DURATION_COORDINATOR,
					current_channel_page);
		} else {
			/* Do nothing once the node is properly running. */
		}
	} else {
		/* Something went wrong; restart. */
		wpan_mlme_reset_req(true);
	}
}
#endif

/*
 * @brief Callback function usr_mlme_start_conf
 *
 * @param status        Result of requested start operation
 */
#if (MAC_START_REQUEST_CONFIRM == 1)
void usr_mlme_start_conf(uint8_t status)
{
	if (status == MAC_SUCCESS) {
		
		/* Set security PIB attributes now. */
		wpan_mlme_set_req(macDefaultKeySource,
		NO_PIB_INDEX,
		&default_key_source);
		
		coord_state = COORD_RUNNING;
#ifdef SIO_HUB
		printf("Started beacon-enabled network in Channel - %d\r\n",
				current_channel);
#endif

		/*
		 * Network is established.
		 * Waiting for association indication from a device.
		 * -> usr_mlme_associate_ind
		 */
		LED_On(LED_NWK_SETUP);

		/*
		 * Now that the network has been started successfully,
		 * the timer for broadcast data transmission is started.
		 * This is independent from the actual number of associated
		 *nodes.
		 */

		/* Start timer to initiate broadcast data transmission. */
		sw_timer_start(APP_TIMER_BC_DATA,
				((uint32_t)APP_BC_DATA_DURATION_MS * 1000),
				SW_TIMEOUT_RELATIVE,
				(FUNC_PTR)bc_data_cb,
				NULL);

